Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you use Hibernate Reactive, look at xref:writing-entities-managed-by-hibernate-reactive-to-kafka[Writing entities managed by Hibernate Reactive to Kafka].
ja_jp: Hibernate Reactiveを使用している場合は、 xref:writing-entities-managed-by-hibernate-reactive-to-kafka[Hibernate Reactiveで管理されているエンティティをKafkaに書き込む] をご覧ください。

source: If you use Hibernate _reactive_, you will use the Mutiny API, and so the resulting code will be:
ja_jp: Hibernate _reactive_ を使用する場合、Mutiny APIを使用することになるので、コードは次のようになります。

source: If you use JAX-RS `ContainerRequestFilter` to set a custom JAX-RS `SecurityContext` then make sure `ContainerRequestFilter` runs in the JAX-RS pre-match phase by adding a `@PreMatching` annotation to it for this custom security context to be linked with Quarkus `SecurityIdentity`, for example:
ja_jp: JAX-RS `ContainerRequestFilter` を使用してカスタム JAX-RS `SecurityContext` を設定する場合は、 `ContainerRequestFilter` が JAX-RS のプレマッチフェーズで実行されていることを確認し、このカスタムセキュリティーコンテキストが Quarkus `SecurityIdentity` とリンクされるように `@PreMatching` アノテーションを追加します。例:

source: If you use JBoss Logging but one of your libraries uses a different logging API, you may need to configure a <<logging-adapters,Logging Adapter>>.
ja_jp: JBoss Logging を使用しているけれども、ライブラリの 1 つが異なるロギング API を使用している場合は、 link:#logging-adapters[ロギングアダプター] を設定する必要がある場合があります。

source: If you use JKS trust-store, use the following configuration:
ja_jp: JKS トラストストアを使用する場合は、次の設定を使用します。

source: If you use JSON-B and JSON-P, make sure you don't use the shortcut methods offered by `jakarta.json.Json` such as `Json.createValue(...)`.
ja_jp: JSON-BとJSON-Pを使用する場合、 `Json.createValue(…​)` のような `jakarta.json.Json` が提供するショートカットメソッドを使用しないように注意してください。

source: If you use Jakarta REST `ContainerRequestFilter` to set a custom Jakarta REST `SecurityContext` then make sure `ContainerRequestFilter` runs in the Jakarta REST pre-match phase by adding a `@PreMatching` annotation to it for this custom security context to be linked with Quarkus `SecurityIdentity`, for example:
ja_jp: Jakarta REST `ContainerRequestFilter` を使用してカスタムの Jakarta REST `SecurityContext` を設定する場合、このカスタムのセキュリティコンテキストを Quarkus `SecurityIdentity` とリンクさせるために `@PreMatching` アノテーションを追加するなどして、 Jakarta REST の事前一致フェーズで `ContainerRequestFilter` が実行されるようにします:

source: If you use Jakarta RESTful Web Services, consider using `quarkus.security.jaxrs.deny-unannotated-endpoints` or `quarkus.security.jaxrs.default-roles-allowed` to set default security requirements instead of HTTP path-level matching because annotations can override these properties on an individual endpoint.
ja_jp: Jakarta RESTful Web サービスを使用する場合は、HTTP パスレベルのマッチングではなく、 `quarkus.security.jaxrs.deny-unannotated-endpoints` または `quarkus.security.jaxrs.default-roles-allowed` を使用して、デフォルトのセキュリティー要件を設定することを検討してください。アノテーションによって、個々のエンドポイントでこれらのプロパティーをオーバーライドできるためです。

source: If you use Keycloak and Bearer tokens then also see the xref:security-keycloak-authorization.adoc[Using Keycloak to Centralize Authorization] guide.
ja_jp: Keycloak と Bearer トークンを使用する場合は、 xref:security-keycloak-authorization.adoc[Keycloakを使用して認可を中央管理]ガイドも参照してください。

source: If you use Keycloak, set a `microprofile-jwt` client scope for the ID token to contain a `groups` claim. For more information, see the link:https://www.keycloak.org/docs/latest/server_admin/#protocol[Keycloak server administration guide].
ja_jp: Keycloak を使用する場合は、ID トークンに `groups` クレームが含まれるように `microprofile-jwt` クライアントスコープを設定します。 詳細は、link:https://www.keycloak.org/docs/latest/server_admin/#protocol[Keycloak サーバー管理ガイド] のリンクを参照してください。

source: If you use MongoDB with Panache in conjunction with Quarkus REST, you can directly return a reactive type inside your Jakarta REST resource endpoint.
ja_jp: MongoDB を Panache とともに Quarkus REST と組み合わせて使用すると、Jakarta REST リソースエンドポイント内でリアクティブ型を直接返すことができます。

source: If you use MongoDB with Panache in conjunction with RESTEasy Reactive, you can directly return a reactive type inside your JAX-RS resource endpoint.
ja_jp: RESTEasyでMongoDB with Panacheを併用している場合、 `quarkus-resteasy-mutiny` エクステンションを含めれば、JAX-RSリソースエンドポイント内でリアクティブ型を直接返すことができます。

source: If you use MongoDB with Panache in conjunction with RESTEasy, you can directly return a reactive type inside your JAX-RS resource endpoint as long as you include the `quarkus-resteasy-mutiny` extension.
ja_jp: RESTEasyでMongoDBとPanacheを併用している場合、 `quarkus-resteasy-mutiny` エクステンションを含めれば、JAX-RSリソースエンドポイント内でリアクティブ型を直接返すことができます。

source: If you use P12 format for the trust-store and the key-certificate, use the following configuration:
ja_jp: トラストストアとキー証明書に P12 形式を使用する場合は、次の設定を使用します。

source: If you use PEM certificates as trust-store, use the following configuration:
ja_jp: PEM 証明書をトラストストアとして使用する場合は、次の設定を使用します。

source: If you use SaaS OIDC providers, such as `Auth0`, and want to run tests against the test (development) domain or to run tests against a remote Keycloak test realm, if you already have `quarkus.oidc.auth-server-url` configured, you can use `OidcTestClient`.
ja_jp: SaaS OIDC プロバイダー (`Auth0` など) を使用していて、テスト (開発) ドメインに対してテストを実行したり、リモート Keycloak テストレルムに対してテストを実行したりする場合、 `quarkus.oidc.auth-server-url` がすでに設定されていれば、 `OidcTestClient` を使用できます。

source: If you use `Basic` or `Form` HTTP-based authentication then you have to add an `IdentityProvider` which can convert a user name and password to `SecurityIdentity`.
ja_jp: `Basic` または `Form` HTTP ベースの認証を使用している場合は、ユーザー名とパスワードを `SecurityIdentity` に変換できる `IdentityProvider` を追加する必要があります。

source: If you use `Basic` or `Form` HTTP-based authentication then you must add an `IdentityProvider` instance that can convert a username and password to a `SecurityIdentity` instance.
ja_jp: `Basic` または `Form` HTTPベース認証を使用する場合、ユーザー名とパスワードを `SecurityIdentity` インスタンスに変換できる `IdentityProvider` インスタンスを追加する必要があります。

source: If you use a `CompletionStage`, you would need to call the service's method to retry. This difference comes from the laziness aspect of Mutiny and its subscription protocol. More details about this can be found in https://smallrye.io/smallrye-mutiny/#_uni_and_multi[the Mutiny documentation].
ja_jp: `CompletionStage` を使用する場合は、サービスのメソッドを呼び出して再試行する必要があります。この違いは、Mutinyとそのサブスクリプションプロトコルの lazy 性の側面から来ています。これについての詳細は Mutiny の link:https://smallrye.io/smallrye-mutiny/#_uni_and_multi[ドキュメント] を参照してください。

source: If you use a `CompletionStage`, you would need to call the service's method to retry. This difference comes from the laziness aspect of Mutiny and its subscription protocol. More details about this can be found in https://smallrye.io/smallrye-mutiny/latest/reference/uni-and-multi/[the Mutiny documentation].
ja_jp: `CompletionStage` を使用する場合は、再試行のためにサービスのメソッドを呼び出す必要があります。この違いは、 Mutiny とそのサブスクリプションプロトコルの lazy (遅延) 性の側面から来ています。これについての詳細は link:https://smallrye.io/smallrye-mutiny/#_uni_and_multi[Mutiny の ドキュメント] を参照してください。

source: If you use a `persistence.xml`, then you cannot use the `quarkus.hibernate-orm.*` properties and only persistence units defined in `persistence.xml` will be taken into account.
ja_jp: `persistence.xml` を使用する場合、 `quarkus.hibernate-orm.*` のプロパティは使用できず、 `persistence.xml` で定義された永続化ユニットのみが考慮されることになります。

source: If you use a browser to connect to a protected resource anonymously, a Basic authentication form displays, prompting you to enter credentials.
ja_jp: ブラウザーを使用して保護されたリソースに匿名で接続する場合は、Basic 認証フォームが表示され、認証情報の入力を求められます。

source: If you use a client injected with the `@RestClient` annotation, you can easily mock it for tests. You can do it with Mockito's `@InjectMock` or with `QuarkusMock`.
ja_jp: `@RestClient` アノテーションが挿入されたクライアントを使用する場合は、テスト用に簡単にモックすることができます。 Mockito の `@InjectMock` または `QuarkusMock` でそれを行うことができます。

source: If you use a https://smallrye.io/smallrye-mutiny-vertx-bindings/latest/[Vert.x client using the Mutiny bindings], use the `andAwait()` methods which block until you get the result without pinning the carrier thread. It includes all the reactive SQL drivers.
ja_jp: https://smallrye.io/smallrye-mutiny-vertx-bindings/latest/[Mutiny バインディングを使用する Vert.x クライアント] を使用する場合は、キャリアースレッドをピニングせずに結果を取得するまでブロックする `andAwait()` メソッドを使用します。これには、すべてのリアクティブ SQL ドライバーが含まれます。

source: If you use regular expressions in an `application.properties` file, make sure four backward slashes are used to represent `.` and other regular expression metadata characters as normal characters, for example, `\\\\.` represents a `.` character while `\\.` represents a metadata character allowing for any character.
ja_jp: `application.properties` ファイルで正規表現を使用する場合、4つのバックスラッシュを使用して、 `.` およびその他の正規表現メタデータ文字を通常の文字として表すようにしてください。たとえば、 `\\\\.` は `.` 文字を表し、 `\\.` は任意の文字を許可するメタデータ文字を表します。

source: If you use separate HTTP server to serve gRPC requests, <<custom-auth-mechanism>> is your only option. Set the `quarkus.grpc.server.use-separate-server` configuration property to `false` so that you can use other mechanisms.
ja_jp: gRPC リクエストを処理するために別の HTTP サーバーを使用する場合、唯一の選択肢が <<custom-auth-mechanism>> です。 他のメカニズムの使用できるようにするには、 `quarkus.grpc.server.use-separate-server` 設定プロパティーを `false` に設定します。

source: If you use the AMQP connector with the `quarkus-smallrye-health` extension, it contributes to the readiness and liveness probes. The AMQP connector reports the readiness and liveness of each channel managed by the connector. At the moment, the AMQP connector uses the same logic for the readiness and liveness checks.
ja_jp: `quarkus-smallrye-health` エクステンションを備えた AMQP コネクターを使用すると、readiness と liveness のプローブに役立ちます。AMQP コネクターは、コネクターによって管理される各チャネルの readiness と liveness を報告します。現時点では、AMQP コネクターは readiness と liveness のチェックに同じロジックを使用しています。

source: If you use the MicroProfile Metrics API in your application, the Micrometer extension will create an adaptive layer to map those metrics into the Micrometer registry. Note that naming conventions between the two systems is different, so the metrics that are emitted when using MP Metrics with Micrometer will change.
ja_jp: アプリケーションで MicroProfile Metrics API を使用する場合、 Micrometer エクステンションは、これらのメトリクスを Micrometer レジストリーにマッピングするための適応レイヤーを作成します。 2 つのシステム間の命名規則が異なるため、Micrometer で MP Metrics を使用する際に生成されるメトリクスが変わることに注意してください。

source: If you use the MicroProfile Metrics API in your application, the Micrometer extension will create an adaptive layer to map those metrics into the Micrometer registry. Note that naming conventions between the two systems is different, so the metrics that are emitted when using MP Metrics with Micrometer will change. You can use a `MeterFilter` to remap names or tags according to your conventions.
ja_jp: アプリケーションで MicroProfile Metrics API を使用している場合、Micrometer エクステンションは、これらのメトリクスを Micrometer レジストリにマッピングするための適応レイヤーを作成します。2 つのシステム間の命名規則は異なるので、MP MetricsをMicrometerと一緒に使用した場合に出力されるメトリクスは変化します。MeterFilters を使用して名前やタグをダッシュボードが必要とするものに再マッピングすることができます。

source: If you use the Mutiny-variant of Vert.x, be aware that the `deployVerticle` method returns a `Uni`, and you would need to trigger a subscription to make the actual deployment.
ja_jp: Vert.x の Mutiny 版を使用する場合、 `deployVerticle` メソッドは `Uni` を返すため、実際のデプロイメントを行うにはサブスクリプションをトリガーする必要があることに注意してください。

source: If you use the OIDC client filters, you must register a custom filter that provides this assertion.
ja_jp: OIDC クライアントフィルターを使用する場合は、このアサーションを提供するカスタムフィルターを登録する必要があります。

source: If you use the Quarkus AWS Lambda extension, SnapStart optimizations are automatically enabled. However, you can enable/disable it explicitly using:
ja_jp: Quarkus AWS Lambdaエクステンションを使用すると、SnapStartの最適化が自動的に有効になります。 ただし、以下を使用して明示的に有効化/無効化することもできます:

source: If you use the Quarkus Amazon Lambda extension, SnapStart optimizations are automatically enabled. However, you can enable/disable it explicitly using:
ja_jp: Quarkus Amazon Lambdaエクステンションを使用すると、SnapStart最適化が自動的に有効になります。しかし、次のオプションを使用して明示的に有効化/無効化することができます。

source: If you use the REST Data with Panache extension to auto-generate your resources, you can still use security annotations within the package `jakarta.annotation.security`. For more information, see the xref:rest-data-panache.adoc#securing-endpoints[Securing endpoints] section of the Quarkus "Generating Jakarta REST resources with Panache" guide.
ja_jp: REST Data with Panache エクステンションを使用してリソースを自動生成する場合でも、パッケージ `jakarta.annotation.security` 内のセキュリティーアノテーションを使用できます。 詳細は、Quarkus の「Panache を使用した Jakarta REST リソースの生成」ガイドの xref:rest-data-panache.adoc#securing-endpoints[エンドポイントのセキュア化] セクションを参照してください。

source: If you use the RabbitMQ connector with the `quarkus-smallrye-health` extension, it contributes to the readiness and liveness probes. The RabbitMQ connector reports the readiness and liveness of each channel managed by the connector.
ja_jp: `quarkus-smallrye-health` エクステンション を備えた RabbitMQ コネクターを使用すると、readinessと liveness の確認に役立ちます。RabbitMQ コネクターは、コネクターによって管理される各チャネルの readubess と liveness を報告します。

source: If you use the Vert.x based server, you can configure TLS by setting the following properties in your `application.properties` file:
ja_jp: Vert.x ベースのサーバーを使用する場合は、 `application.properties` ファイルで次のプロパティーを設定することで TLS を設定できます。

source: If you use the `@CloudEventMapping` annotation on your function you can map the Cloud Event type trigger and the Cloud Event response. In this example the `annotatedChain` function will be triggered by the `annotated` Cloud Event type and the response will be mapped to a `lastChainLink` type and `annotated` Cloud Event source.
ja_jp: 関数に `@CloudEventMapping` アノテーションを使用すると、Cloud Event タイプのトリガーとCloud Event レスポンスをマッピングできます。この例では、 `annotatedChain` 関数は `annotated` Cloud Event タイプによってトリガされ、レスポンスは `lastChainLink` タイプと `annotated` Cloud Eventソースにマッピングされます。

source: If you use the default values in the OpenTelemetry properties, there is no necessity to include anything in the `application.properties` file.
ja_jp: OpenTelemetry プロパティーでデフォルト値を使用する場合、 `application.properties` ファイルに何かを含める必要はありません。

source: If you use the endpoints provided by Quarkus, they will not be protected by xdoc:security-csrf-prevention.adoc[CSRF], but if you define your own endpoints and use this JavaScript library to access them you will need to configure CSRF via headers:
ja_jp: Quarkus が提供するエンドポイントを使用する場合、xdoc:security-csrf-prevention.adoc[CSRF] によって保護されませんが、 独自のエンドポイントを定義し、この JavaScript ライブラリーを使用してそれらにアクセスする場合は、ヘッダー経由で CSRF を設定する必要があります。

source: If you use the gRPC Java server, you can configure TLS by setting the following properties in your `application.properties` file:
ja_jp: gRPC Java サーバーを使用する場合は、 `application.properties` ファイルで次のプロパティーを設定することで TLS を設定できます。

source: If you use the link:https://quarkus.io/extensions/io.quarkus/quarkus-smallrye-health[`quarkus-smallrye-health`] extension, the `quarkus-agroal` and reactive client extensions automatically add a readiness health check to validate the datasource.
ja_jp: link:https://quarkus.io/extensions/io.quarkus/quarkus-smallrye-health[quarkus-smallrye-health] エクステンションを使用する場合、 `quarkus-agroal` およびリアクティブクライアントエクステンションは、 データソースを検証するためのreadiness ヘルスチェックを自動的に追加します。

source: If you use the same executable in all environments, and a certificate expires, the application needs to be rebuilt, and redeployed into production with the new certificate, which is an inconvenience.
ja_jp: すべての環境で同じ実行可能ファイルを使用している場合、証明書の有効期限が切れると、アプリケーションを再構築し、新しい証明書を使って本番環境に再展開する必要があり、不便です。

source: If you use the standard `ObjectId` ID type, don't forget to retrieve your entity by creating a new `ObjectId` when the identifier comes from a path parameter. For example:
ja_jp: 標準の `ObjectId` ID型を使用する場合、識別子がパスパラメータから来ているときは、新しい `ObjectId` を作成してエンティティを取得することを忘れないでください。例えば以下のように行います。

source: If you use xref:dev-services[Dev Services], launching the container manually is not necessary.
ja_jp: link:#dev-services[Dev Services]を使用している場合は、手動でコンテナを起動する必要はありません。

source: If you use xref:redis-dev-services.adoc[Dev Services for Redis], launching the container manually is not necessary!
ja_jp: link:redis-dev-services.html[Dev Services for Redis]を使用している場合は、手動でコンテナを起動する必要はありません。

source: If you use xref:security-oidc-code-flow-authentication.adoc[OpenID Connect Authorization Code Flow] to protect Quarkus endpoints, then you need to configure Quarkus to tell it how to connect to OpenID Connect providers, how to authenticate to such providers, which scopes to use, and so on.
ja_jp: xref:security-oidc-code-flow-authentication.adoc[OpenID Connect認可コードフロー] を使用してQuarkusのエンドポイントを保護する場合は、OpenID Connectプロバイダーへの接続方法、そのようなプロバイダーへの認証方法、使用するスコープなどをQuarkusに伝えるように設定する必要があります。

source: If you use xref:security-openid-connect-web-authentication.adoc[OpenID Connect Authorization Code Flow] to protect Quarkus endpoints then you need to configure Quarkus to tell it how to connect to OpenID Connect providers, how to authenticate to such providers, which scopes to use, etc.
ja_jp: xref:security-openid-connect-web-authentication.adoc[OpenID Connect Authorization Code Flow] を使用して Quarkus エンドポイントを保護する場合は、OpenID Connect プロバイダーへの接続方法、そのようなプロバイダーへの認証方法、使用するスコープなどを指示するように Quarkus を設定する必要があります。

source: If you want a lower memory footprint and faster initialization times for your Funqy function, you can compile your Java code to a native executable. Just make sure to rebuild your project with the `-Dnative` switch.
ja_jp: Funqy 関数のメモリーフットプリントを減らし、初期化時間を短縮したい場合は、Java コードをネイティブ実行可能ファイルにコンパイルすることができます。その場合は、必ず `-Dnative` スイッチでプロジェクトをリビルドしてください。

source: If you want a lower memory footprint and faster initialization times for your Funqy function, you can compile your Java code to a native executable. Just make sure to rebuild your project with the `-Pnative` switch.
ja_jp: Funqy 関数のメモリーフットプリントを減らし、初期化時間を短縮したい場合は、Javaコードをネイティブ実行可能ファイルにコンパイルすることができます。 `-Pnative` スイッチでプロジェクトをリビルドすることを確認してください。

source: If you want a lower memory footprint and faster initialization times for your lambda, you can compile your Java code to a native executable. Just make sure to rebuild your project with the `-Dnative` switch.
ja_jp: ラムダのメモリフットプリントを小さくし、初期化時間を短縮したい場合は、Javaコードをネイティブ実行可能ファイルにコンパイルできます。 `-Dnative` ・スイッチでプロジェクトをリビルドしてください。

source: If you want a lower memory footprint and faster initialization times for your lambda, you can compile your Java code to a native executable. Just make sure to rebuild your project with the `-Pnative` switch.
ja_jp: Lambda のメモリーフットプリントを減らし、初期化時間を短縮したい場合は、Javaコードをネイティブ実行可能ファイルにコンパイルすることができます。 `-Pnative` スイッチでプロジェクトをリビルドすることを確認してください。

source: If you want continuous testing to start automatically you can set `quarkus.test.continuous-testing=enabled` in `application.properties`. If you don't want it at all you can change this to `disabled`.
ja_jp: 継続的テストを自動的に開始させたい場合は、 `application.properties` で `quarkus.test.continuous-testing=enabled` を設定します。全く必要ない場合は、これを `disabled` に変更できます。

source: If you want run the Infinispan Server container with Cross Site Replication configuration, you need to provide a site name.
ja_jp: Cross Site Replication構成でInfinispan Serverコンテナを実行する場合、サイト名を指定する必要があります。

source: If you want the ability to run such integration test in both JVM and/or native executables, we have some cool helpers for you: just add either `@QuarkusTestResource(H2DatabaseTestResource.class)` or `@QuarkusTestResource(DerbyDatabaseTestResource.class)` on any class in your integration tests, this will make sure the test suite starts (and stops) the embedded database into a separate process as necessary to run your tests.
ja_jp: このような統合テストを JVM やネイティブ実行可能ファイルの両方で実行できるようにしたい場合は、いくつかの便利なヘルパーを利用できます。統合テストの任意のクラスに `@QuarkusTestResource(H2DatabaseTestResource.class)` または `@QuarkusTestResource(DerbyDatabaseTestResource.class)` を追加するだけで、テストスイートがテストを実行するために必要なデータベースを別のプロセスに組み込んで起動 (および停止) するようになります。

source: If you want to access the Kafka record objects directly, use:
ja_jp: Kafka レコードオブジェクトに直接アクセスする場合は、次を使用します。

source: If you want to access the Pulsar message objects directly, use:
ja_jp: Pulsar メッセージオブジェクトに直接アクセスする場合は、次を使用します。

source: If you want to allow HTTP clients to invoke on your Funqy functions on AWS Lambda, Quarkus allows you to expose multiple Funqy functions through HTTP deployed as one AWS Lambda. This approach does add overhead over the regular Funqy AWS Lambda integration and also requires you to use AWS API Gateway.
ja_jp: HTTPクライアントがAWS Lambda上のFunqy関数を呼び出すことを許可したい場合、Quarkusでは、1つのAWS LambdaとしてデプロイされたHTTPを通して複数のFunqy関数を公開することができます。この方法では、通常のFunqy AWS Lambdaの統合よりもオーバーヘッドが追加され、AWS API Gatewayを使用する必要があります。

source: If you want to allow HTTP clients to invoke your Funqy functions on Google Cloud Functions, Quarkus allows you to expose multiple Funqy functions through HTTP deployed as one Google Cloud Function. This approach does add overhead over the regular Funqy Google Cloud Function integration.
ja_jp: HTTP クライアントが Google Cloud Function 上で Funqy 関数を呼び出すことができるようにする場合、Quarkus では、1 つの Google Cloud Function としてデプロイされた HTTP を通じて複数の Funqy 関数を公開することができます。なお、このアプローチは、通常の Funqy Google Cloud Function の統合よりもオーバーヘッドが増加します。

source: If you want to build a native executable with a different Docker image (for instance to use a different GraalVM version), use the `-Dquarkus.native.builder-image=<image name>` build argument.
ja_jp: 異なる Docker イメージでネイティブ実行可能ファイルをビルドしたい場合 (たとえば、異なる GraalVM バージョンを使用する場合など) は、 `-Dquarkus.native.builder-image=<image name>` の build 引数を使用してください。

source: If you want to build a native executable, make sure you have GraalVM installed correctly and just add a `native` property to the build
ja_jp: ネイティブ実行可能ファイルをビルドする場合は、GraalVM が正しくインストールされていることを確認し、ビルドに `native` プロパティーを追加してください。

source: If you want to compress everything then we recommended that you use the `quarkus.http.enable-compression=true` setting instead to globally enable compression support.
ja_jp: すべてを圧縮したい場合は、代わりに `quarkus.http.enable-compression=true` の設定を使用してグローバルに圧縮サポートを有効にすることをお勧めします。

source: If you want to configure logging for your `@QuarkusTest`, don't forget to set up the `maven-surefire-plugin` accordingly. In particular, you need to set the appropriate `LogManager` using the `java.util.logging.manager` system property.
ja_jp: `@QuarkusTest` のロギングを設定したい場合は、それに応じて `maven-surefire-plugin` を設定することを忘れないでください。特に、 `java.util.logging.manager` system プロパティーを使用して適切な `LogManager` を設定する必要があります。

source: If you want to configure something extra for a specific category, create a named handler like `quarkus.log.handler.[console|file|syslog].<your-handler-name>.*` and set it up for that category by using `quarkus.log.category.<my-category>.handlers`.
ja_jp: 特定のカテゴリーに対して特別な設定をする場合は、 `quarkus.log.handler.[console|file|syslog].<your-handler-name>.*` のような名前付きハンドラーを作成し、 `quarkus.log.category.<my-category>.handlers` を使ってそのカテゴリー用に設定します。

source: If you want to consume only active beans, you can inject an `InjectableInstance<>` and call `getActive()` to get the single instance or `listActive()` to get all instances:
ja_jp: アクティブな Bean のみを使用する場合は、 `InjectableInstance<>` を注入し、 `getActive()` を呼び出して 1 つのインスタンスを取得するか、 `listActive()` を呼び出してすべてのインスタンスを取得します。

source: If you want to continue on this topic check:
ja_jp: このトピックを続けたい方は以下をチェック下さい:

source: If you want to contribute badges or links in your extension card on the Dev UI overview page, like this:
ja_jp: Dev UI概要ページのエクステンションのカードにバッジやリンクを追加したい場合は、このようにします:

source: If you want to customise the registration and login flow, you can also handle user and credential creation and logins yourself via your own logic (see <<Handling login and registration endpoints yourself>>).
ja_jp: 登録とログインフローをカスタマイズしたい場合は、独自のロジックを使用して、 ユーザーと認証情報の作成およびログインも自身で処理できます (<<Handling login and registration endpoints yourself>> を参照)。

source: If you want to customize the way the tokens are associated with the session cookie, register a custom `io.quarkus.oidc.TokenStateManager` implementation as an `@ApplicationScoped` CDI bean.
ja_jp: トークンをセッションクッキーに関連付ける方法をカスタマイズしたい場合は、カスタム `io.quarkus.oidc.TokenStateManager' 実装を `@ApplicationScoped` CDI Bean として登録します。
